const HOT_CUSTOMERS = [
  "星饗廚房",
  "富順",
  "鴨公館",
  "十興",
  "麻希達",
  "雲pasta",
  "兩餐",
  "牛範生",
  "格香",
  "湖口臭豆腐"
];

const CUSTOMERS = [
  "鴨公館",
  "牛範生",
  "和會",
  "十興",
  "醺築",
  "行家",
  "騎士漢堡",
  "新豐家鄉",
  "湖口家鄉",
  "湖口臭豆腐",
  "新豐臭豆腐",
  "新豐阿力",
  "富順",
  "兩餐",
  "麻希達",
  "星饗廚房",
  "新南興",
  "雲pasta",
  "黑皮驊",
  "格香",
  "芬享",
  "笑哈哈",
  "仟崧",
  "古墨尼",
  "新好吃",
  "宋記豬血湯"
];

const UNITS = [
  "斤",
  "公斤",
  "公克",
  "個",
  "件",
  "箱",
  "株",
  "把",
  "籃",
  "包",
  "顆",
  "罐",
  "條",
  "盒",
  "副"
];

const PRODUCTS = {
  vegetables: [
    "高麗菜",
    "青江菜",
    "青蔥",
    "小白菜",
    "鵝白菜",
    "紅蘿蔔",
    "白蘿蔔",
    "洋蔥",
    "花椰菜",
    "四季豆",
    "娃娃菜",
    "空心菜",
    "九層塔",
    "馬鈴薯",
    "蒜頭",
    "牛蕃茄"
  ],

  mushrooms: [
    "金針菇",
    "香菇",
    "杏鮑菇",
    "白精靈菇",
    "黑木耳",
    "竹籤海帶"
  ],

  meat: [
    "豬絞肉",
    "豬血",
    "鴨血",
    "雞腿",
    "雞胸肉",
    "蝦仁",
    "蛤蜊"
  ],

  tofu: [
    "百頁豆腐",
    "雞蛋豆腐",
    "板豆腐",
    "嫩豆腐",
    "大溪黑豆乾",
    "豆乾",
    "素雞"
  ],

  fruits: [
    "蘋果",
    "香蕉",
    "芭樂",
    "金桔"
  ],

  processed: [
    "米血",
    "米腸",
    "芋頭糕",
    "貢丸",
    "水杏花枝丸"
  ],

  other: [
    "米",
    "陽春麵",
    "油麵",
    "冬粉"
  ]
};

const HOT_PRODUCTS = [
  "高麗菜",
  "青江菜",
  "青蔥",
  "小白菜",
  "鵝白菜",
  "紅蘿蔔",
  "白蘿蔔",
  "洋蔥",
  "金針菇",
  "花椰菜",
  "四季豆",
  "娃娃菜",
  "空心菜",
  "百頁豆腐",
  "九層塔",
  "馬鈴薯",
  "蒜頭",
  "鴨血",
  "豬血",
  "豬絞肉"
];